// 48
// 题目
// 某某公司非常感谢您对贵公司工资系统开发提供的帮助，现公司需要进行员工信息系统升级，以帮助管理员工信息，功能接口如下：
// 1 添加员工
// 2 删除员工：删除指定id的员工，当员工id不存在时不进行处理
// 3 员工最大年龄，没有员工时，返回0。
// 4 员工平均薪资(输出向下取整的整数)，没有员工时,返回0。
// 5 员工总人数
// 总共有n条指令（0<n<=100）,对于添加、删除员工指令结束后系统都会输出当前公司员工数量。

// 输入
// 输入n代表有n条指令(0<n<=100)
// 接下来有n条指令的相关操作 order（1<=order<=5）,当order为1或2时会有额外的录入，具体如下：
// order 为1：输入员工信息（员工id（保证id不重复），员工年龄，员工工资，员工姓名（姓名长度不超过10））。
// order 为2：输入id号

// 输出
// 由main函数中定义输出，同学接口过程不需要进行数据输出。

// 输入样例
// 6
// 1
// 969 26 13472 GFDuB
// 3
// 1
// 938 30 13056 iroAEjwc
// 4
// 5
// 2
// 969

